{
  "projects": [
    {
      "id": 1,
      "title": "Smoke alert bot",
      "position": "BOT developer",
      "description": "AI powered smoke alert bot for forest fires monitoring",
      "cover": "http://slnnzmtl.xyz/projects/smoke-alert-bot/cover.jpg",
      "html": "<p>I have been part of the development of an innovative project that aims to use AI and video cameras to monitor forests for the early detection of wildfires.<h2>Tech stack</h2><ul><li>Python<li>Telegram.ext</ul><p>By placing cameras strategically, the system records live videos and uses AI algorithms to analyze them in real time. This helps to quickly spot potential fires by identifying changes in temperature and the environment, and it sends immediate alerts to forest authorities for quick action.</p><img alt=image src=http://slnnzmtl.xyz/projects/smoke-alert-bot/image-2.jpg><p>The project is flexible and can be expanded, and ongoing improvements to the AI model make it more accurate.</p><img alt=image src=http://slnnzmtl.xyz/projects/smoke-alert-bot/image-1.jpg><p>This project highlights how technology can help protect the environment and prevent the damaging effects of forest fires on ecosystems and communities.",
      "tags": ["Python", "Telegram"]
    },
    {
      "id": 2,
      "title": "KML Map Viewer",
      "position": "Fullstack Developer",
      "description": "User-friendly platform for exploring and understanding location data through interactive maps and KML file integration.",
      "cover": "http://slnnzmtl.xyz/projects/kml-viewer/image-1.jpg",
      "html": "<p>I developed a web-based application that leverages Google Maps to visualize and interact with extensive location data stored in KML files. This platform empowers users to explore geographical information with ease and clarity.</p><img src=http://slnnzmtl.xyz/projects/kml-viewer/image-1.jpg alt=Map Viewer Interface><h2>Tech stack</h2><ul><li>JavaScript</li><li>MySQL</li><li>Vue.js</li><li>Laravel</li><li>PHP</li></ul><p>The application features a user-friendly interface that allows users to select specific affiliates. Upon selection, the map dynamically displays relevant location data derived from uploaded KML files. Administrators have the capability to upload and manage KML files for each affiliate, ensuring data accuracy and currency.</p><img src=http://slnnzmtl.xyz/projects/kml-viewer/image-2.jpg alt=Map Viewer Interface><p>Users can interact with the map to view detailed information about objects within the affiliate's area. The layered KML file display enables users to toggle and visualize data from various sources, providing a comprehensive understanding of the spatial information. This project streamlines the process of accessing and interpreting complex location data, making it accessible to a broader audience.</p><p>The system is designed for scalability and maintainability, utilizing a robust tech stack to ensure performance and reliability. Future enhancements could include advanced filtering options and integration with additional data sources.</p>",
      "tags": ["Vue 3", "JavaScript", "Google Maps API", "MySQL", "Laravel", "PHP"]
    },
    {
      "id": 3,
      "title": "Universal CRM System",
      "position": "Lead Frontend Developer",
      "description": "Developed a highly configurable and user-friendly CRM system with a focus on intuitive frontend components, data visualization, and efficient state management.",
      "url": "woki.one",
      "cover": "http://slnnzmtl.xyz/projects/woki/image-1.jpg",
      "html": "<p>I played a key role in developing a universal CRM, leading the frontend team and contributing to architecture and functionality. This involved crafting user-friendly interfaces, ensuring code quality, and maintaining system health.</p><img src=http://slnnzmtl.xyz/projects/woki/image-1.jpg alt=Universal CRM system /><h2>Tech stack</h2><ul><li>Vue 2 & Vue 3</li><li>Vuetify</li><li>ApexCharts</li><li>Pinia</li></ul><img src=http://slnnzmtl.xyz/projects/woki/image-2.jpg alt=CRM System Interface><h2>Engineering & Team Leadership</h2><ul><li><b>Frontend:</b> Developed intuitive components using Vue.js, Vuetify, and ApexCharts.</li><li><b>Architecture:</b> Optimized system performance and scalability.</li><li><b>Team Leadership:</b> Led the frontend team, ensuring timely delivery of high-quality code.</li><li><b>Code Reviews:</b> Conducted code reviews to maintain quality and consistency.</li></ul><h2>Key Features & Functionality</h2><ul><li><b>User-Focused Features:</b> Translated user needs into system enhancements.</li><li><b>Configurability:</b> Engineered a highly configurable CRM for diverse user needs.</li></ul><h2>Refactoring & Maintainability</h2><ul><li><b>Codebase Refactoring:</b> Improved code structure, readability, and maintainability.</li><li><b>Industry Standards:</b> Ensured adherence to industry standards.</li></ul><img src=http://slnnzmtl.xyz/projects/woki/image-3.jpg /><p>This project highlights my ability to develop high-quality frontend components, lead a team, and contribute to the success of a complex software project. My focus on user needs, architecture, and code maintainability ensures the CRM remains robust, adaptable, and valuable.</p>",
      "tags": ["Vue 2", "Vue 3", "Vuetify", "ApexCharts", "Pinia"]
    },
    {
      "id": 4,
      "title": "Subscription-first marketplace",
      "position": "Senior Frontend Developer",
      "description": "Contributed to the frontend development of Subbly.co, an e-commerce platform for subscription businesses, focusing on user experience, performance, and collaboration.",
      "url": "subbly.co",
      "cover": "http://slnnzmtl.xyz/projects/subbly/image-4.jpg",
      "html": "<p>I contributed to the frontend development of Subbly.co, an e-commerce platform for subscription-based marketplaces. My focus was creating user-friendly experiences for merchants and customers.</p><img src=http://slnnzmtl.xyz/projects/subbly/image-1.jpg alt=Subbly><h2>My Contributions</h2><ul><li><b>Interface Development:</b> Developed and maintained responsive UIs with modern JavaScript frameworks.</li><li><b>Collaboration:</b> Worked with designers and backend developers to implement features and designs.</li><li><b>Subscription Features:</b> Contributed to subscription management, payment processing, and dynamic content loading.</li><li><b>Performance:</b> Optimized for speed and scalability to improve load times.</li><li><b>Code Quality:</b> Participated in code reviews to maintain code quality.</li></ul><p>This project helped me develop my skills in building user-centric e-commerce solutions. I'm grateful for the opportunity to contribute to a platform that helps businesses succeed with subscriptions.</p>",
      "tags": ["Vue 2", "Vue 3", "TypeScript"],
      "images": [
        "http://slnnzmtl.xyz/projects/subbly/image-2.jpg",
        "http://slnnzmtl.xyz/projects/subbly/image-3.jpg",
        "http://slnnzmtl.xyz/projects/subbly/image-1.jpg"
      ]
    },
    {
      "id": 5,
      "title": "Online marketplace",
      "position": "Frontend Developer",
      "description": "Collaborated on the development of a multilingual e-commerce platform featuring auction mechanics.",
      "cover": "http://slnnzmtl.xyz/projects/auction/image-1.jpg",
      "html": "<p>I collaborated on the development of a multilingual e-commerce platform featuring auction and bidding mechanics. The platform enables users to buy and sell products through auctions, with a focus on intuitive user experience and robust functionality.</p><img src=http://slnnzmtl.xyz/projects/auction/image-1.jpg alt=Online Marketplace Interface><h2>My Contributions</h2><ul><li>Designed and implemented responsive product and grid layouts</li><li>Developed personalized recommendation modules to enhance user engagement</li><li>Created an interactive reviews section to build trust and community</li><li>Implemented multilingual support to serve diverse markets</li></ul><img src=http://slnnzmtl.xyz/projects/auction/image-2<img src=http://slnnzmtl.xyz/projects/auction/image-1.jpg alt=Online Marketplace Interface><h2>Tech stack</h2><ul><li>React</li><li>JavaScript</li><li>Redux</li><li>Context API</li><li>i18n for internationalization</li><li>Bulma CSS framework</li></ul><p>The platform was architected for scalability and maintainability, with careful attention to state management and performance optimization. The multilingual capabilities and auction mechanics created a dynamic marketplace experience that effectively connected buyers and sellers across language barriers.</p>",
      "tags": ["React", "JavaScript", "Bulma", "i18n"]
    }
  ]
}
