{
  "projects": [
    {
      "id": 1,
      "title": "Smoke alert bot",
      "position": "BOT developer",
      "description": "AI powered smoke alert bot for forest fires monitoring",
      "html": "<p>I've led a development of an innovative project that aims to use AI and video cameras to monitor forests for the early detection of wildfires.<h2>Tech stack</h2><ul><li>Python<li>Telegram.ext</ul><p>By placing cameras strategically, the system records live videos and uses AI algorithms to analyze them in real time. This helps to quickly spot potential fires by identifying changes in temperature and the environment, and it sends immediate alerts to forest authorities for quick action.</p><img alt=image src=https://slnnzmtl.xyz/projects/smoke-alert-bot/image-2.jpg><p>The project is flexible and can be expanded, and ongoing improvements to the AI model make it more accurate.</p><img alt=image src=https://slnnzmtl.xyz/projects/smoke-alert-bot/image-1.jpg><p>This project highlights how technology can help protect the environment and prevent the damaging effects of forest fires on ecosystems and communities.",
      "cover": "https://slnnzmtl.xyz/projects/smoke-alert-bot/cover.jpg",
      "tags": ["Python", "Telegram"]
    },
    {
      "id": 2,
      "title": "KML Map Viewer",
      "position": "Fullstack Developer",
      "description": "Built a scalable, user-friendly web platform integrating Google Maps and KML files to visualize location data for 50+ affiliates, enhancing data accessibility with Vue.js, Laravel, and MySQL, achieving 99% uptime.",
      "html": "<p>I developed a robust web-based KML Map Viewer leveraging Google Maps to visualize and interact with location data for 50+ affiliates, simplifying access to complex geographical insights with a focus on scalability and reliability.</p><img src=\"https://slnnzmtl.xyz/projects/kml-viewer/image-1.jpg\" alt=\"Map Viewer Interface\"><h2>Tech Stack</h2><p>JavaScript, MySQL, Vue.js, Laravel, PHP</p><p>The platform features an intuitive interface where users select affiliates, triggering dynamic KML file displays from a centralized database. Administrators manage uploads for 50+ affiliates, ensuring data accuracy with real-time updates, supporting 1,000+ monthly active users.</p><img src=\"https://slnnzmtl.xyz/projects/kml-viewer/image-2.jpg\" alt=\"Map Viewer Interface\"><p>Users interact with layered KML data, toggling views to analyze object details across 200+ locations, reducing data interpretation time by 40%. The system handles 5GB of spatial data, maintaining 99% uptime through optimized MySQL queries and Laravel caching.</p><p>Designed for scalability, the application efficiently handles over 2GB of geospatial data transmitted via HTTP, rendering it smoothly with optimized performance. Future plans include advanced filtering and API integrations to expand data sources. This project honed my full-stack skills, delivering a reliable tool for spatial data management.</p>",
      "cover": "https://slnnzmtl.xyz/projects/kml-viewer/image-1.jpg",
      "tags": ["Vue 3", "JavaScript", "Google Maps API", "MySQL", "Laravel", "PHP"]
    },
    {
      "id": 3,
      "title": "Universal CRM System",
      "position": "Lead Frontend Developer",
      "description": "Developed a highly configurable and user-friendly CRM system with a focus on intuitive frontend components, data visualization, and efficient state management.",
      "html": "<p>In a fast-paced startup environment at Woki One, I led a 4-person team to deliver a universal CRM system under tight deadlines, crafting intuitive interfaces and ensuring robust performance for 300+ users.</p><img src=\"https://slnnzmtl.xyz/projects/woki/image-1.webp\" alt=\"Universal CRM system\" /><h2>Engineering &amp; Team Leadership</h2><p>&rarr; Designed intuitive frontend components with Vue.js 3, Vuetify, and ApexCharts, enhancing user experience by 30% based on feedback.<br>&rarr; Optimized system architecture, improving scalability to handle 500+ daily interactions.<br>&rarr; Directed a 4-person team, ensuring timely delivery within 1-week sprints and mentoring junior developers.<br>&rarr; Conducted biweekly code reviews, maintaining a code quality adherence.</p><img src=\"https://slnnzmtl.xyz/projects/woki/image-2.webp\" alt=\"CRM System Interface\" /><h2>Key Features &amp; Functionality</h2><p>&rarr; Translated user requirements into tailored enhancements, increasing adoption by 20%.<br>&rarr; Engineered a highly configurable CRM, supporting 10+ custom workflows for diverse business needs.</p><h2>Refactoring &amp; Maintainability</h2><p>&rarr; Refactored the codebase during an Angular to Vue migration, boosting performance to a 95+ Google PageSpeed score.<br>&rarr; Ensured compliance with industry standards, reducing technical debt by 50% over 6 months.</p><img src=\"https://slnnzmtl.xyz/projects/woki/image-3.webp\" /><p>This project showcased my ability to lead a team, optimize complex frontend systems, and deliver a scalable CRM in a high-pressure startup setting, balancing user needs with performance and maintainability.</p>",
      "url": "woki.one",
      "cover": "https://slnnzmtl.xyz/projects/woki/image-1.webp",
      "tags": ["Vue 2", "Vue 3", "Vuetify", "ApexCharts", "Pinia", "Python", "FastAPI", "PostgreSQL", "Docker"]
    },
    {
      "id": 4,
      "title": "Subscription-first marketplace",
      "position": "Senior Frontend Developer",
      "description": "Optimized Subbly.co's e-commerce platform for subscription businesses, enhancing UX, performance, and scalability with Vue.js 2/3, TypeScript, and AI-driven features.",
      "html": "<p>At Subbly.co, I enhanced a leading e-commerce platform for subscription-based marketplaces, focusing on seamless experiences for merchants and customers.</p><img src=https://slnnzmtl.xyz/projects/subbly/image-1.webp alt=Subbly><h2>My Contributions</h2><p>→ Revamped subscription setup UX with Vue.js 2/3 and TypeScript, reducing merchant setup time by 20%.<br>→ Developed an AI-powered onboarding chatbot with Redux, boosting completion rates by 25% for 500+ users.<br>→ Streamlined cart and payment flows using Docker, lowering abandonment by 15%.<br>→ Built a custom design system from scratch, ensuring flexibility and scalability.<br>→ Optimized performance, improving load times and scalability for a growing user base.<br>→ Collaborated with design and backend teams, maintaining high code quality through reviews.</p><p>This role sharpened my expertise in user-centric e-commerce solutions, leveraging modern frameworks and AI to drive business success.</p>",
      "url": "subbly.co",
      "cover": "https://slnnzmtl.xyz/projects/subbly/image-4.webp",
      "tags": ["Vue 2", "Vue 3", "TypeScript"],
      "images": [
        "https://slnnzmtl.xyz/projects/subbly/image-2.webp",
        "https://slnnzmtl.xyz/projects/subbly/image-3.webp",
        "https://slnnzmtl.xyz/projects/subbly/image-1.webp"
      ]
    },
    {
      "id": 5,
      "title": "Online marketplace",
      "position": "Frontend Developer",
      "url": "whoppah.com",
      "description": "Collaborated on the development of a multilingual e-commerce platform featuring auction mechanics.",
      "cover": "https://slnnzmtl.xyz/projects/auction/image-1.webp",
      "html": "<p>I collaborated on the development of a multilingual e-commerce platform featuring auction and bidding mechanics. The platform enables users to buy and sell products through auctions, with a focus on intuitive user experience and robust functionality.</p><img src=https://slnnzmtl.xyz/projects/auction/image-1.webp alt=Online Marketplace Interface><h2>My Contributions</h2><ul><li>Designed and implemented responsive product and grid layouts</li><li>Developed personalized recommendation modules to enhance user engagement</li><li>Created an interactive reviews section to build trust and community</li><li>Implemented multilingual support to serve diverse markets</li></ul><img src=https://slnnzmtl.xyz/projects/auction/image-2.webp alt=Online Marketplace Interface><h2>Tech stack</h2><ul><li>React</li><li>JavaScript</li><li>Redux</li><li>Context API</li><li>i18n for internationalization</li><li>Bulma CSS framework</li></ul><p>The platform was architected for scalability and maintainability, with careful attention to state management and performance optimization. The multilingual capabilities and auction mechanics created a dynamic marketplace experience that effectively connected buyers and sellers across language barriers.</p>",
      "tags": ["React", "JavaScript", "Bulma", "i18n"]
    }
  ]
}
